{
  "backend/main.mo": "Main Motoko actor implementing the gym tracker backend with user profile management, workout generation (full body, upper body, lower body), workout history, muscle recovery tracking, and access control.",
  "backend/migration.mo": "Motoko migration module that defines stable state types (workout history and user profiles maps) and provides a no-op run function for schema migrations.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose, key features, and notable implementation details.",
  "frontend/DEPLOY_RETRY.md": "Deployment retry log documenting multiple build/deploy attempts with notes on critical backend fixes, primarily around Motoko filter syntax corrections for muscle group matching and recovery state updates.",
  "frontend/index.html": "HTML entry point for the Gym Tracker PWA, including viewport meta tags, PWA manifest link, Apple touch icons, iOS splash screen links, and the React app root div.",
  "frontend/public/manifest.json": "PWA manifest for Gym Tracker defining app name, icons (192x192 and 512x512), display mode (standalone), dark theme colors, and fitness/health categories.",
  "frontend/src/App.tsx": "Root React component managing authentication state, page navigation between login/onboarding/dashboard/workout/history/progress pages, and workout validation before passing generated workouts to preview.",
  "frontend/src/components/BodyweightModal.tsx": "A dialog modal component that allows users to log/update their bodyweight and weight unit (kg/lb), with input validation and profile update mutation.",
  "frontend/src/components/BottomNav.tsx": "A fixed bottom navigation bar with tabs for Home, Workout, Progress, History, and Settings, opening a SettingsModal for the settings tab.",
  "frontend/src/components/ExerciseChangeModal.tsx": "A dialog modal that fetches and displays alternative exercises for the same muscle group, allowing the user to swap the current exercise and recording the change via a backend mutation.",
  "frontend/src/components/Header.tsx": "A sticky app header displaying the FitTrack logo/title with Settings and Logout action buttons.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "An empty file with no content.",
  "frontend/src/components/PullToRefresh.tsx": "A wrapper component that implements native-feeling pull-to-refresh behavior using touch events, showing an animated spinner indicator and triggering an async refresh callback.",
  "frontend/src/components/RecoveryHeatmap.tsx": "A card component that displays muscle group recovery percentages with color-coded progress bars and badges, supporting optional weighted leg subgroup breakdown.",
  "frontend/src/components/SettingsModal.tsx": "A dialog modal component for editing user profile settings (gender, bodyweight, weight unit, training frequency, dark mode, rest timers) with save handlers that call backend mutation hooks and display toast notifications.",
  "frontend/src/components/SplashScreen.tsx": "A full-screen animated splash screen displayed on app load, showing a dumbbell icon, app name, and tagline with fade/zoom-in animations.",
  "frontend/src/components/StatusBar.tsx": "A sticky top status bar component that displays the current date and the user's workout streak count with a flame icon.",
  "frontend/src/components/WorkoutShareModal.tsx": "A dialog modal that generates a shareable URL and QR code for a given workout, with copy-to-clipboard and native Web Share API support.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data (user profile, workouts, exercises, recovery state), with helpers for error classification, validation, and logging.",
  "frontend/src/hooks/useWakeLock.ts": "A React hook that manages the Screen Wake Lock API to prevent the screen from dimming, with automatic re-acquisition on visibility change and comprehensive error handling.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, enforces a dark-only Telegram-themed color scheme via CSS custom properties, and adds mobile utilities like safe area insets and tap target sizing.",
  "frontend/src/lib/profileCache.ts": "Empty file with no content.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, clear, and check for an active workout session in sessionStorage, with a 24-hour expiry guard.",
  "frontend/src/lib/timestampUtils.ts": "Utility functions to detect and convert backend nanosecond BigInt timestamps to milliseconds, validate timestamp ranges, and format them as human-readable date/time strings.",
  "frontend/src/lib/workoutPreviewSections.ts": "Builds ordered workout sections from a flat exercise list, enforcing a fixed muscle-group order (Chest→Back→Shoulders→Arms→Legs→Core) with Legs split into subsections and unknown groups appended alphabetically.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page component displaying user stats, workout streak, recovery heatmap, and navigation to new workout, history, and progress pages, with pull-to-refresh and lazy-loaded modals.",
  "frontend/src/pages/HistoryPage.tsx": "History page component that lists past workouts with formatted timestamps and volume, and renders a calendar highlighting trained dates, with pull-to-refresh support.",
  "frontend/src/pages/LoginPage.tsx": "Renders the FitTrack login page with Internet Identity authentication, displaying app features and a login button that shows a loading spinner while connecting.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Allows users to select a workout type (Full Body, Upper Body, Lower Body) and triggers AI-generated workout plans via mutation hooks, then passes the result to a parent callback.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects new user profile data (gender, bodyweight, weight unit, training frequency, rest times) via a form and saves it to the backend using the useSaveCallerUserProfile hook.",
  "frontend/src/pages/ProgressPage.tsx": "Displays muscle group recovery status and weekly training volume with pull-to-refresh support, using color-coded progress indicators for each muscle group.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty file with no content or implementation.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Shows a preview of a generated workout with validation for duplicates and data integrity, allowing users to regenerate or swap individual exercises before starting the session.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Manages an active workout session with per-exercise set logging, rest timers, wake lock, personal record detection, confetti animations, and session persistence via local storage.",
  "frontend/src/types.ts": "Defines frontend-only TypeScript interfaces for workout tracking, including Exercise, Workout, SetData, RecoveryState, and related data structures used throughout the frontend.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom color tokens (using CSS variables), extended border radii, box shadows, font sizes, and animation keyframes for the frontend UI.",
  "project_state.json": "Tracks the current project state (version 19), documenting known backend bugs (Motoko filter syntax, recovery mode issues), architectural notes, and pending fix/refactor feature requests for the workout generator backend."
}